package ru.telegrambot.telegram_bot_support.constant;

import java.util.Arrays;
import java.util.List;

public class TelegramConstant {

    public static final String TEXT_NOTIFICATION = "Ваша закончится через 2 дня. Если хотите продолжить, то нажмите \"/start\" и следуете инструкции.";
    public static final String TEXT_ABOUT_ENDED_SUBSCRIPTION = "Ваша подписка закончилась";

    public static final long YOUR_CHAT_ID = 1347452135L;

    public static final List<String> TARGET_CHANNELS = Arrays.asList(
            "-1002609655325",
            "-1002516647653",
            "-1002474533819",
            "-1002606419459",
            "-1002470520763",
            "-1002371982832",
            "-1002447362979",
            "-1002321683429",
            "-1002437373849",
            "-1002312070417",
            "-1002204134144",
            "-1002310613326",
            "-1002408434608",
            "-1002352206827",
            "-1002256648573",
            "-1002475008860",
            "-1002263290251",
            "-1002488299137",
            "-1002468548677",
            "-1002325280281",
            "-1002403060603",
            "-1002388388285",
            "-1002473414634",
            "-1002435482616",
            "-1002151575253",
            "-1002290283206",
            "-1002245781148",
            "-1002305247421",
            "-1002456060200",
            "-1002353334761",
            "-1002375539545",
            "-1002252660577",
            "-1002313125209",
            "-1002461854522",
            "-1002278060954",
            "-1002310579562",
            "-1002433148270",
            "-1002478792069",
            "-1002382050444",
            "-1002366354411",
            "-1002253767805",
            "-1002362673028",
            "-1002316239087",
            "-1002321127666",
            "-1002420219728",
            "-1002394756627"
    );
}
